[
  {
    "group": 1,
    "name": "Agarre lineal de muñeca (derecha a izquierda)",
    "subgroups": [
      {
        "name": "Agarre de muñeca",
        "techniques": [
          {
            "technique": 1,
            "description": "Abre la mano, hace un chuzón a los ojos con la palma hacia arriba, y luego, pega un puño con el nudillo medio a los metacarpos de la mano que sujeta."
          },
          {
            "technique": 2,
            "description": "Saliendo por el lado de la mano agarrada en Ap Kubi, ejecuta Batang Son al esternón."
          },
          {
            "technique": 3,
            "description": "Saliendo por el lado de la mano agarrada en Ap Kubi, ejecuta Chunji Pam Chumok Chigi al plexo."
          },
          {
            "technique": 4,
            "description": "Abre la mano, la gira hacia afuera (altura de la cabeza), bloqueo con mi rodilla la rodilla del oponente para desequilibrarlo y que no se mueva, Luego, ejecuta Pal Kup a las costillas."
          },
          {
            "technique": 5,
            "description": "Gira la mano hacia adentro para exponer y tensionar el pronador del codo, luego realiza Son Nal Chigi al pronador y luego otro al cuello."
          },
          {
            "technique": 6,
            "description": "Chuzón hacia atrás en diagonal girando la mano hacia adentro para liberarse en ChumChum Sogi y luego Pal Kup al plexo."
          },
          {
            "technique": 7,
            "description": "Expone la muñeca, Batang Son y con la mano liberada ejecuta An Son Nal Chigi al cuello."
          },
          {
            "technique": 8,
            "description": "Expone la muñeca, Batang Son y con la mano liberada gira por dentro y realiza Pal Kup al plexo."
          },
          {
            "technique": 9,
            "description": "Levanta el brazo y se mete por debajo en Chu Chum Sogi y realiza Pal Kup al plexo."
          },
          {
            "technique": 10,
            "description": "Chuzón hacia atrás en diagonal girando la mano hacia adentro para liberarse en ChumChum Sogi y luego realiza Son Karak a la cara."
          },
          {
            "technique": 11,
            "description": "Hala al oponente, y ejecuta An Dary Chanoki a la rodilla."
          },
          {
            "technique": 12,
            "description": "Hala al oponente, y ejecuta Mureup Chagi a la ingle."
          },
          {
            "technique": 13,
            "description": "Levanta el brazo y Chong Kang I Ap Chanoki a las costillas."
          },
          {
            "technique": 14,
            "description": "Agarra del cabello y ejecuta Mureup Chagi a la cara."
          },
          {
            "technique": 15,
            "description": "Agarra por la nuca al oponente (con el pulgar hacia abajo por el lado contrario al lado agarrado). Presiona el costado del cuello con el dedo del corazón, para hacerlo bajar. Luego realizaMureup Chagi al plexo."
          },
          {
            "technique": 16,
            "description": "Abre la mano, gira la mano quedando el dorso mirando hacia abajo; con la otra mano agarra la mano del oponente, le gira la mano haciendo llave y con el filo de la mano libre ayuda a la palanca."
          },
          {
            "technique": 17,
            "description": "La mano agarrada hace una 'U' con los dedos pulgar e índice, hacia arriba para sujetar la muñeca del oponente, la mano libre agarra la mano del oponente por los metacarpos, gira hacia adentro llevando a que la mano del oponente quede en 'U' (con los dedos apuntando hacia arriba) mientras hala para extender el brazo del oponente para quedar con el codo del agarre, sobre el codo del oponente a la vez que hace presión hacia al el oponente en la muñeca."
          },
          {
            "technique": 18,
            "description": "Agarra la muñeca y gira por dentro hacia afuera ejecutando 16."
          },
          {
            "technique": 19,
            "description": "Misma 5 pero atrayendo al plexo y asestando un codazo descendente en el codo."
          },
          {
            "technique": 20,
            "description": "Hace presión en el musculo lateral del codo y gira por dentro, agarra del cinturón y el cabello y ejecuta chokto doligi en la parte anterior de la rodilla."
          }
        ]
      },
      {
        "name": "Agarre de la casaca (boca manga)",
        "techniques": [
          {
            "technique": 21,
            "description": "Agarra los metacarpos, torsión hacia adentro y pam chumok a la axila."
          },
          {
            "technique": 22,
            "description": "Péndulo a la par con Batang Son el plexo."
          }
        ]
      },
      {
        "name": "Agarre de la casaca (codo)",
        "techniques": [
          {
            "technique": 23,
            "description": "Sujeta los metacarpos para asegurar la mano, y ejecuta pion Son por dentro y hacia abajo."
          },
          {
            "technique": 24,
            "description": "Misma 23 pero continua el movimiento pasando por debajo del brazo y hace presión en el codo con el antebrazo."
          }
        ]
      },
      {
        "name": "Agarre de la casaca (hombro)",
        "techniques": [
          {
            "technique": 25,
            "description": "Igual que 21."
          },
          {
            "technique": 26,
            "description": "Igual que 17."
          }
        ]
      },
      {
        "name": "Agarre de la casaca (cuello de la casaca / nuca)",
        "techniques": [
          {
            "technique": 27,
            "description": "Con las dos manos rodeando el codo ejecuta presión hacia abajo. (partir el codo)"
          },
          {
            "technique": 28,
            "description": "Tango."
          }
        ]
      },
      {
        "name": "Agarre de la casaca (solapas / pecho, pulgar hacia arriba)",
        "techniques": [
          {
            "technique": 29,
            "description": "Saludo chino."
          },
          {
            "technique": 30,
            "description": "Igual que 17."
          }
        ]
      },
      {
        "name": "Agarre de la casaca (solapas / pecho, subiendo después de agarrar)",
        "techniques": [
          {
            "technique": 31,
            "description": "Presión en dedo pulgar hacia atrás."
          },
          {
            "technique": 32,
            "description": "Gira la cabeza hacia el lado de la mano que está agarrando, para desnucar."
          }
        ]
      },
      {
        "name": "Agarre de la casaca (solapas / pecho, mano invertida, pulgar hacia abajo)",
        "techniques": [
          {
            "technique": 33,
            "description": "Cocodrilo."
          },
          {
            "technique": 34,
            "description": "Golpe con el antebrazo al codo."
          }
        ]
      },
      {
        "name": "Agarre de cinturón (de frente, dedos hacia arriba)",
        "techniques": [
          {
            "technique": 35,
            "description": "Pam chumok a los metacarpos."
          },
          {
            "technique": 36,
            "description": "Aplauso al codo."
          }
        ]
      },
      {
        "name": "Agarre de cinturón (de frente, dedos hacia abajo)",
        "techniques": [
          {
            "technique": 37,
            "description": "Presión en dedo pulgar."
          },
          {
            "technique": 38,
            "description": "Asegura y presión hacia arriba agarrado de la casaca."
          }
        ]
      },
      {
        "name": "Agarre de cinturón (cadera izquierda o derecha)",
        "techniques": [
          {
            "technique": 39,
            "description": "asegura y ejecuta iop chagui."
          },
          {
            "technique": 40,
            "description": "asegura con el antebrazo por debajo, con el otro brazo lo baja y sube haciendo presión en el cuello con los dos brazos."
          }
        ]
      },
      {
        "name": "Agarre de casaca (pecho, izquierdo o derecho)",
        "techniques": [
          {
            "technique": 41,
            "description": "Como 29"
          },
          {
            "technique": 42,
            "description": "Codazo al codo, devuelve con otro codazo por dentro y ejecuta un último codazo a la cara."
          }
        ]
      },
      {
        "name": "Agarre de cabeza (cabello / cabeza)",
        "techniques": [
          {
            "technique": 43,
            "description": "Toalla."
          },
          {
            "technique": 44,
            "description": "Saludo chino."
          },
          {
            "technique": 45,
            "description": "Cocodrilo"
          },
          {
            "technique": 46,
            "description": "Bloqueo hacia abajo y puño al mentón."
          }
        ]
      }
    ]
  },
  {
    "group": 2,
    "name": "Agarre cruzado de muñeca (derecha a derecha)",
    "subgroups": [
      {
        "name": "Agarre de muñeca",
        "techniques": [
          {
            "technique": 1,
            "description": "Son Nal a la cara con la mano libre."
          },
          {
            "technique": 2,
            "description": "Son Nal al pronador del codo con la mano libre."
          },
          {
            "technique": 3,
            "description": "Son Nal Dung a la cara por debajo del brazo agarrado."
          },
          {
            "technique": 4,
            "description": "Pal Kup similar a la técnica #4 de agarre lineal de muñeca."
          },
          {
            "technique": 5,
            "description": "Contra agarra por fuera y con la mano libre, Chumok Galbi Chigi."
          },
          {
            "technique": 6,
            "description": "Contra agarra por fuera y codazo a la cara."
          },
          {
            "technique": 7,
            "description": "Presiona el pronador del codo con la mano libre y ejecuta Pal Kup a la cara con la otra mano."
          },
          {
            "technique": 8,
            "description": "Presiona el pronador del codo con la mano libre y con la mano libre, agarra la insersión del pectoral."
          },
          {
            "technique": 9,
            "description": "Igual a la anterior, pero ejecuta Agum Son Chigi a la garganda."
          },
          {
            "technique": 10,
            "description": "Contra agarra por fuera, la mano libre baja la mano agarrada y con esa misma mano (la agarrada) Batang Son a la cara."
          },
          {
            "technique": 11,
            "description": "Contra agarra por fuera, Yop Chanoki a la corva (misma pierna de la mano agarrada)"
          },
          {
            "technique": 12,
            "description": "Igual que la anterior pero patea la otra pierna en la parte inferor de la rodilla."
          },
          {
            "technique": 13,
            "description": "Contra agarra por fuera y el hombro o antebrazo con la mano libre. Pega rodillazo al torso con pierna igual a la mano agarrada."
          },
          {
            "technique": 14,
            "description": "Contra agarra por fuera, extiende el brazo del oponente y golpea rodillazo hacia la zona intercostal cerca de la axila."
          },
          {
            "technique": 15,
            "description": "Contra agarra por fuera, extiende el brazo del oponente y golpea rodillazo hacia abajo sobre el codo."
          },
          {
            "technique": 16,
            "description": "Contra agarra por fuera/dentro el antebrazo. Con la pierna del lado agarrado An Dary Chanoky a la cadera para tumbar al oponente."
          },
          {
            "technique": 17,
            "description": "Con la mano libre hace como 16 de básicas a la vez que pega (a la pierna del lado atacante) Yop Chanoki a la cara interna de la rodilla, para evitar la discipación del giro de la muñeca."
          },
          {
            "technique": 18,
            "description": "Contra agarra por fuera/debajo el antebrazo. An Dary Chanoky a la parte interior de la rodilla con la pierna de la mano agarrada. Y con la otra pierna Murup Chagi al muslo de la otra pierna."
          },
          {
            "technique": 19,
            "description": "Igual a la anterior pero cambia el rodillazo al muslo por Bituro Chagi (a la cara, abdomen o genitales)."
          },
          {
            "technique": 20,
            "description": "Contra agarra, con la mano contraria a la mano agarrada, Chokto Doligi a la rodilla del oponente. Cuando este cae arrodillado, Murup Chigi a la cara con la otra pierna."
          }
        ]
      },
      {
        "name": "Agarre de la casaca (boca manga)",
        "techniques": [
          {
            "technique": 21,
            "description": "Mete la mano libre por debajo y dentro del agarre, para soltar y contra agarrar el bíceps de la mano atacante. La mano atacada agarra la solapa del oponente. La pierna contraria a la de la solapa, se apoya en la pelvis del oponente para saltar y pegar rodillazo al pecho o cara con la otra pierna."
          },
          {
            "technique": 22,
            "description": "Contra agarra por dentro, extiende el brazo del oponente y con la mano libre palanquea el codo hacia arriba."
          }
        ]
      },
      {
        "name": "Agarre de la casaca (codo)",
        "techniques": [
          {
            "technique": 23,
            "description": "Contra agarra por fuera palanquea el codo con Pal Mok."
          },
          {
            "technique": 24,
            "description": "Contra agarra por fuera y palanquea codo con codo (como #17 de las técnicas básicas)"
          }
        ]
      },
      {
        "name": "Agarre de la casaca (hombro)",
        "techniques": [
          {
            "technique": 25,
            "description": "Contra agarra por fuera muñeca y antegraz, hace flexionar el brazo del oponente hacia su pecho y lo baja, con el brazo en el plano horizontal."
          },
          {
            "technique": 26,
            "description": "Como #17 de técnicas básicas, con la muñeca horizontal (codo del oponente mirando arriba)."
          }
        ]
      },
      {
        "name": "Agarre de la casaca (cuello de la casaca / nuca)",
        "techniques": [
          {
            "technique": 27,
            "description": "Como #17 de técnicas básicas inversa (codo del oponente mirando abajo) mano en 'U' (Salida del #16 de técnicas básicas, en vertical)."
          },
          {
            "technique": 28,
            "description": "Contra agarra por fuera con ambas manos para soltar y hacer como 7 de llave contra puño. (con la mano libre como #16 de técnicas básicas y al soltarse, la mano agarrada ayuda a hacer como 7 de llave contra puño)."
          }
        ]
      },
      {
        "name": "Agarre de la casaca (solapas / pecho, pulgar hacia arriba)",
        "techniques": [
          {
            "technique": 29,
            "description": "Contra agarra por dentro. Mete la mano libre para agarrar la garganta del oponente, palanquear el codo y la muñeca (dedos hacia el codo)."
          },
          {
            "technique": 30,
            "description": "Contra agarra por fuera la muñeca del oponente con ambas manos, palanquea hacia el lado y abajo (segal) (la mano libre se apoya sobre el dorso del atacante y ambas manos con dedos apuntando en igual dirección)."
          }
        ]
      },
      {
        "name": "Agarre de la casaca (solapas / pecho, subiendo después de agarrar)",
        "techniques": [
          {
            "technique": 31,
            "description": "Contra agarra por fuera, se desplaza hacia la espalda del adversario a la vez que patea la corva con el mismo pie de la mano agarrada. Al hacerlo arrodillar lo ahorca con su propia mano, agarra la mano libre y sin dejar de pisarle la corva lo hace girar el tronco en el sentido del estangulamiento."
          },
          {
            "technique": 32,
            "description": "Contra agarra por fuera, la mano libre agarra por la solapa por encima del brazo del oponente para estrangular (pulgar abajo), con la misma pierna de la mano agarrada Yop Chanoki a la corva, mientras el oponente cae se golpea codazo al pecho o cara con la mano agarrada."
          }
        ]
      },
      {
        "name": "Agarre de la casaca (solapas / pecho, mano invertida, pulgar hacia abajo)",
        "techniques": [
          {
            "technique": 33,
            "description": "16 de técnicas básicas corta, con palanca de apoyo no con la mano sino con el antebrazo."
          },
          {
            "technique": 34,
            "description": "Palanquea codo, levanta al adversario, flexiona el codo y con su propia muñeca le golpea la cara."
          }
        ]
      },
      {
        "name": "Agarre de cinturón (de frente, dedos hacia arriba)",
        "techniques": [
          {
            "technique": 35,
            "description": "Palanquea codo, levanta al adversario y hace torsión parecido a #7 de llave contra puño."
          },
          {
            "technique": 36,
            "description": "Palanquea codo hacia abajo y arrastra (acuersta boca abajo)."
          }
        ]
      },
      {
        "name": "Agarre de cinturón (de frente, dedos hacia abajo)",
        "techniques": [
          {
            "technique": 37,
            "description": "Golpea lateralmente sobre el codo (como Montong An Maki), mete el brazo del codazo para cuñar el codo, la otra mano flexiona la muñeca (dedos hacia el codo). Palma hacia el bíceps."
          },
          {
            "technique": 38,
            "description": "La mano libre agarra y #16 de técnicas básicas."
          }
        ]
      },
      {
        "name": "Agarre de cinturón (cadera izquierda o derecha)",
        "techniques": [
          {
            "technique": 39,
            "description": "La mano libre agarra y #18 de técnicas básicas."
          },
          {
            "technique": 40,
            "description": "Contra agarra por fuera y lanza como #9 de técnicas básicas."
          }
        ]
      },
      {
        "name": "Agarre de casaca (pecho, izquierdo o derecho)",
        "techniques": [
          {
            "technique": 41,
            "description": "#16 de técnicas básicas. Con movimiento parecido a #36 de este grupo."
          },
          {
            "technique": 42,
            "description": "Contra agarra por fuera. Con la mano libre y por fuera presiona el pronador del codo para pegar codazo (como #7 de esta secuencia). Mete la mano libre por debajo, agarra nuca y lanza."
          }
        ]
      },
      {
        "name": "Agarre de cabeza (cabello / cabeza)",
        "techniques": [
          {
            "technique": 43,
            "description": "Contra agarra con ambas manos la mano agarrada, patea genitales y lanza de cadera. (por fuera, espalda con pecho); palanqueando el codo del brazo atacante."
          },
          {
            "technique": 44,
            "description": "Dung Chumok y por debajo con la mano libre y lanzo por los hombros (como la de #19 de contra agarres de Judo)."
          },
          {
            "technique": 45,
            "description": "Contra agarra por dentro, la mano libre flexiona el codo del oponente (pulgar por dentro). Gira y lanza como palanqueando el codo (como #7 de llave contra puño)."
          },
          {
            "technique": 46,
            "description": "Contra agarra con ambas manos. Se gira hacia dadentro vuelta completa y se lanza al oponente con la mano libre."
          }
        ]
      }
    ]
  },
  {
    "group": 3,
    "name": "Puño contra puño",
    "techniques": [
      {
        "technique": 1,
        "description": "Montong bakkat makki y Batang Son al plexo."
      },
      {
        "technique": 2,
        "description": "Montong bakkat makki y pyon Son al plexo."
      },
      {
        "technique": 3,
        "description": "Montong bakkat makki y agum Son al cuello."
      },
      {
        "technique": 4,
        "description": "Montong bakkat makki y golpe con el filo de la mano al cuello."
      },
      {
        "technique": 5,
        "description": "Montong ant makki y codazo de fuera."
      },
      {
        "technique": 6,
        "description": "Montong ant makki y codazo desde afuera."
      },
      {
        "technique": 7,
        "description": "Montong ant makki y golpe con el filo de la mano al cuello."
      },
      {
        "technique": 8,
        "description": "Giro con bloqueo y 8 (de las básicas)."
      },
      {
        "technique": 9,
        "description": "Olgoro olgul makki y golpe al plexo con los nudillos."
      },
      {
        "technique": 10,
        "description": "Esquiva y puño a las costillas."
      }
    ]
  },
  {
    "group": 4,
    "name": "Contra agarres por la espalda",
    "subgroups": [
      {
        "name": "Contra agarre de la nuca (una mano)",
        "techniques": [
          {
            "technique": 1,
            "description": "Chu chum Sogi y golpe con una mano al torso y luego golpe con la otra a la cara."
          },
          {
            "technique": 2,
            "description": "Tango."
          }
        ]
      },
      {
        "name": "Contra agarre ambos hombros",
        "techniques": [
          {
            "technique": 3,
            "description": "16 de básicas."
          },
          {
            "technique": 4,
            "description": "medio 16 y golpe a la mandibula."
          }
        ]
      },
      {
        "name": "Contra agarre de los codos (ambas manos)",
        "techniques": [
          {
            "technique": 5,
            "description": "chu chum Sogi y empujon con el codo."
          },
          {
            "technique": 6,
            "description": "llave de codo por detrás (lanzamiento)."
          }
        ]
      },
      {
        "name": "Contra agarre de las mangas (ambas manos)",
        "techniques": [
          {
            "technique": 7,
            "description": "arriba y torsión, lanzamiento como #9 de básicas."
          },
          {
            "technique": 8,
            "description": "arriba y torsión, lanzamiento como #9 de básicas con barrido por entre las piernas por el frente."
          }
        ]
      },
      {
        "name": "Contra agarre de las muñecas (ambas manos)",
        "techniques": [
          {
            "technique": 9,
            "description": "contra agarre de muñecas y dwit chagi"
          },
          {
            "technique": 10,
            "description": "giro por la espalda y 18."
          }
        ]
      },
      {
        "name": "Contra agarre del cinturón por detrás (una mano)",
        "techniques": [
          {
            "technique": 11,
            "description": "montong nulo Batangt makki y Batang Son a las costillas."
          },
          {
            "technique": 12,
            "description": "codazo a la cara."
          }
        ]
      }
    ]
  },
  {
    "group": 5,
    "name": "Patada contra puño",
    "subgroups": [
      {
        "name": "",
        "techniques": [
          {
            "technique": 1,
            "description": "Antari."
          },
          {
            "technique": 2,
            "description": "Bakkatari."
          },
          {
            "technique": 3,
            "description": "Ap chuk ap chagui."
          },
          {
            "technique": 4,
            "description": "Yop chagi."
          },
          {
            "technique": 5,
            "description": "Antari chanoki (a la rodilla)."
          },
          {
            "technique": 6,
            "description": "Sujeta el brazo y la nuca del oponente y ejecuta mureup chigi al abdomen."
          },
          {
            "technique": 7,
            "description": "Agarra la muñeca y Dolio."
          },
          {
            "technique": 8,
            "description": "Agarra la muñeca y Tuit Dolio desde fuera."
          },
          {
            "technique": 9,
            "description": "Tora yop."
          },
          {
            "technique": 10,
            "description": "Huryeo."
          }
        ]
      }
    ]
  },
  {
    "group": 6,
    "name": "Contra abrazos",
    "subgroups": [
      {
        "name": "Contra Urracarrana",
        "techniques": [
          {
            "technique": 1,
            "description": "bajo con fuerza, chu chum Sogi, y codazo a la cara."
          },
          {
            "technique": 2,
            "description": "bajo con fuerza, chu chum Sogi, y 16."
          }
        ]
      },
      {
        "name": "Urracarrana mano sobre mano",
        "techniques": [
          {
            "technique": 3,
            "description": "bajo con fuerza, chu chum Sogi, y pion Son a la mano."
          },
          {
            "technique": 4,
            "description": "bajo con fuerza, chu chum Sogi, y codazo infeior por un lado y superior por el otro."
          }
        ]
      },
      {
        "name": "Urracarrana completa",
        "techniques": [
          {
            "technique": 5,
            "description": "cojo un dedo medio y bajo."
          },
          {
            "technique": 6,
            "description": "bajo con fuerza, chu chum Sogi, y cojo la cabeza del otro y lo lanzo por el frente."
          }
        ]
      },
      {
        "name": "Abrazo bajo: mano muñeca",
        "techniques": [
          {
            "technique": 7,
            "description": "pion Son a los metacarpos."
          },
          {
            "technique": 8,
            "description": "torsión y pesion muñeca contra mano."
          }
        ]
      },
      {
        "name": "Abrazo bajo: dedos entre lazados",
        "techniques": [
          {
            "technique": 9,
            "description": "cojo un dedo medio y bajo."
          },
          {
            "technique": 10,
            "description": "coje la mano por los metacarpos y tuerce hacia adentro, y luego patada."
          }
        ]
      },
      {
        "name": "Abrazo de frente",
        "techniques": [
          {
            "technique": 11,
            "description": "presión en la ingle y dual Batang Son."
          },
          {
            "technique": 12,
            "description": "Presión en la ingle y cabeza hacia atrás."
          }
        ]
      },
      {
        "name": "Abrazo de espalda",
        "techniques": [
          {
            "technique": 13,
            "description": "presión en la ingle y codazo a la cara."
          },
          {
            "technique": 14,
            "description": "presión en la ingle y codazo infeior por un lado y superior por el otro."
          }
        ]
      }
    ]
  },
  {
    "group": 7,
    "name": "Sentado",
    "subgroups": [
      {
        "name": "",
        "techniques": [
          {
            "technique": 1,
            "description": "Lorem ipsum"
          },
          {
            "technique": 1,
            "description": "Lorem ipsum"
          }
        ]
      }
    ]
  },
  {
    "group": 8,
    "name": "Agarre a ambos brazos",
    "subgroups": [
      {
        "name": "",
        "techniques": [
          {
            "technique": 1,
            "description": "Lorem ipsum"
          },
          {
            "technique": 1,
            "description": "Lorem ipsum"
          }
        ]
      }
    ]
  },
  {
    "group": 9,
    "name": "Llave contra puño",
    "subgroups": [
      {
        "name": "",
        "techniques": [
          {
            "technique": 1,
            "description": "Lorem ipsum"
          },
          {
            "technique": 1,
            "description": "Lorem ipsum"
          }
        ]
      }
    ]
  },
  {
    "group": 10,
    "name": "Saludo y conducción",
    "subgroups": [
      {
        "name": "",
        "techniques": [
          {
            "technique": 1,
            "description": "Lorem ipsum"
          },
          {
            "technique": 1,
            "description": "Lorem ipsum"
          }
        ]
      }
    ]
  },
  {
    "group": 11,
    "name": "Contra agarres de Judo",
    "subgroups": [
      {
        "name": "",
        "techniques": [
          {
            "technique": 1,
            "description": "Lorem ipsum"
          },
          {
            "technique": 1,
            "description": "Lorem ipsum"
          }
        ]
      }
    ]
  },
  {
    "group": 12,
    "name": "Acostado",
    "subgroups": [
      {
        "name": "",
        "techniques": [
          {
            "technique": 1,
            "description": "Lorem ipsum"
          },
          {
            "technique": 1,
            "description": "Lorem ipsum"
          }
        ]
      }
    ]
  }
]